dot_config/emacs/config.org
#+Title: My emacs litterate config
#+author: Kristian Bagge
#+property: header-args :mkdirp yes

* Inspiration
- Tecosaur
- Prot
- Emacs from scratch
- Hlissner
* Start up
** Early init
#+begin_src emacs-lisp :tangle early-init.el
  ;; early-init.el -*- lexical-binding: t; -*-

  ;;; Garbage collection
    (setq gc-cons-threshold most-positive-fixnum)    ; Very large threshold for garbage
                                                 ; collector during init
    ;; Reset garbage collector limit after init process has ended (8Mo)
    (add-hook 'after-init-hook
              #'(lambda () (setq gc-cons-threshold (* 8 1024 1024))))

  (require 'package)
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
  ;; Comment/uncomment this line to enable MELPA Stable if desired.  See `package-archive-priorities`
  ;; and `package-pinned-packages`. Most users will not need or want to do this.
  ;;(add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/") t)
  (package-initialize)

  (setq use-package-always-ensure t)
  (setq package-install-upgrade-built-in t)
  (require 'use-package)

  ;; vc-use package. Is part of emacs 30.something. I'm using 29, so I install manually.
  (unless (package-installed-p 'vc-use-package)
    (package-vc-install "https://github.com/slotThe/vc-use-package"))
  (require 'vc-use-package)

  ;; Menu bar disabled
    (menu-bar-mode -1)
    (tool-bar-mode -1)
    (tooltip-mode -1)
    (scroll-bar-mode -1)

#+end_src
** Keybinds
I use bind-keys to make maps, and later assign bindings to those maps.
It is important to keep this in the beginning of the file for other packages to be able to map to them.
#+begin_src emacs-lisp :tangle my-modules/my-startup.el
  ;;; Binding maps - bind-key
  ;; I use bind-key to make to maps with each two prefixes. Then later I assign commands to each map.
  (bind-keys
   :prefix-map my-notes-map
   :prefix "C-c n"
   :prefix "M-n")

  (bind-keys
   :prefix-map my-open-map
   :prefix "C-c o"
   :prefix "M-o")

  (bind-keys
   :prefix-map my-insert-map
   :prefix "C-c i")

  (bind-keys :map my-insert-map
             ("c" . insert-char)
             )

#+end_src

** Dashboard
#+begin_src emacs-lisp :tangle my-modules/my-startup.el
;;;; Dashboard
(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook))

#+end_src
** Restart emacs
#+begin_src emacs-lisp :tangle my-modules/my-startup.el
  ;;;; Restart emacs
  (use-package restart-emacs
    :defer t)

  
(provide 'my-startup)
#+end_src

* Load modules
With a modular config I find it easier to switch to try out new packages. Just make a new module, activate it and deactivate the old. Then it is just as easy to switch back in case I preferred the old setup. Thereby it is also easy to deactivate packages, if I don't use them for a time.
#+begin_src emacs-lisp :tangle init.el
   ;; Add the folder with modules to load path
   (mapc
    (lambda (string)
      (add-to-list 'load-path (locate-user-emacs-file string)))
    '("my-modules")) ; More folders can be added if nedded '("example1" "example2"))

   ;; General
   (require 'my-startup)
   (require 'my-defaults)
   (require 'my-dired)
   ;; Theming
   (require 'my-modus-theme)
   (require 'my-general-theming)
   (require 'my-fonts)
  ;; (require 'my-modeline)
  (require 'my-doom-modeline)
   ;; Editor
   (require 'my-editor-settings)
   (require 'my-workspace)
   (require 'my-spelling)
   (require 'my-completion)
   (require 'my-minibuffer)
   ;; User
   (require 'my-user-info)
   (require 'my-org-setup)
   ;; Notes
   (require 'my-denote-setup)
   (require 'my-citar-setup)
   ;; Office
   (require 'my-office-setup)
   (require 'my-elfeed)
   (require 'my-pocket)
   (require 'my-mu4e)
   ;; Programming
   (require 'my-programming-setup)
   (require 'my-python)
   (require 'my-chezmoi)
   (require 'my-latex)
   (require 'my-git)
   (require 'my-llm)
#+end_src
* My defaults
Tweaking the built in parts to my liking.
Remember the .tmpl ending is due to chezmoi injecting sensitive information from pass.
#+begin_src emacs-lisp :tangle my-modules/my-defaults.el.tmpl
    ;;;; No warning for 80 char docstrin
    (setq native-comp-async-report-warnings-errors 'silent)

  ;;;; Custom file
  (setq custom-file (concat user-emacs-directory "custom.el"))
  (when (file-exists-p custom-file)
    (load custom-file))
  ;;;; Handling files
  (setq confirm-nonexistent-file-or-buffer nil
        create-lockfiles nil)

  ;; Kill current buffer (instead of asking first buffer name)
  (bind-key "C-x k" 'kill-current-buffer)

  ;; Give normal names to files in buffer list
  (setq uniquify-buffer-name-style 'forward)

  ;; remember recent files
  (add-hook 'after-init-hook #'recentf-mode)
  (setq recentf-max-saved-items 250)
  (bind-key "C-x C-r" 'consult-recent-file)

  ;;;; Shortcut for config and server
  ;; First let's make a function for opening a specific file, so we can call it with leader key. Weekday avoid using lampda so we have a nice name for which-key to show.
  (defun open-emacs-config () (interactive) (find-file "~/.local/share/chezmoi/dot_config/emacs/config.org"))
  (defun connect-to-server () (interactive) (find-file "/ssh:server@server.kristianbagge.com:")) ;; For now this opens up dired in ~/ folder on server by using TRAMP.
  ;; Bind it
  (bind-key "C" 'open-emacs-config my-open-map)
  (bind-key "S" 'connect-to-server my-open-map)

  ;;;; Sudo this file
  ;; My try at a function that sudo this file
  (defun sudo-this-file (file-name)
    "Like find file, but opens the file as root."
    (interactive "FSudo Find File: ")
    (let ((tramp-file-name (concat "/sudo::" (expand-file-name file-name))))
      (find-file tramp-file-name)))
  (bind-key "s" 'sudo-this-file my-open-map)

  (setq backup-directory-alist       ; File name patterns and backup directory names.
        `(("." . ,(expand-file-name "backups" user-emacs-directory)))
        make-backup-files t          ; Backup of a file the first time it is saved.
        vc-make-backup-files t       ; No backup of files under version contr
        backup-by-copying t          ; Don't clobber symlinks
        version-control t            ; Version numbers for backup files
        delete-old-versions t        ; Delete excess backup files silently
        kept-old-versions 4          ; Number of old versions to keep
        kept-new-versions 7          ; Number of new versions to keep
        delete-by-moving-to-trash t) ; Delete files to trash

  (setq auto-save-list-file-prefix ; Prefix for generating auto-save-list-file-name
        (expand-file-name ".auto-save-list/.saves-" user-emacs-directory)
        auto-save-default t        ; Auto-save every buffer that visits a file
        auto-save-timeout 20       ; Number of seconds between auto-save
        auto-save-interval 200)    ; Number of keystrokes between auto-saves
  (setq auto-save-file-name-transforms
        `((".*" "~/.config/emacs/.auto-saves/" t))) ; Make a folder for autosaves instead of cluttering all my folders.

  ;;;; Pop up windows
  (use-package popper
    :ensure t ; or :straight t
    :bind (("C-`"   . popper-toggle)
           ("M-`"   . popper-cycle)
           ("C-M-`" . popper-toggle-type))
    :init
    (setq popper-reference-buffers
          '("\\*Messages\\*"
            "Output\\*$"
            "\\*Async Shell Command\\*"
            help-mode
            compilation-mode))
    (popper-mode +1)
    (popper-echo-mode +1))                ; For echo area hints

  ;;;; No beep 
  (setq ring-bell-function #'ignore
        visible-bell nil)
  (blink-cursor-mode -1)

  ;;;; Y or N, not yes or no
  (setq use-short-answers t)
                                          ;  (defalias 'yes-or-no-p 'y-or-n-p)
  ;;;; Repeat mode (nice for C-x o)
  (repeat-mode 1)
  ;;;; A simple frame title
  (setq frame-title-format '(" %b"))


    (provide 'my-defaults)
#+end_src

* Dired
#+begin_src emacs-lisp :tangle my-modules/my-dired.el 
  ;;;; Dired / dirvish setup
  (use-package dired
    :ensure nil
    :init
    (setq dired-recursive-copies 'always) ; operate on entire folder
    (setq dired-recursive-delete 'always) ; operate on entire folder
    (setq dired-dwim-target t) ; Let emacs try to get the destination (other dired window)

    :bind (:map my-open-map
                ("d" . dired))
    :hook
    (dired-mode . dired-hide-details-mode)
    )
(provide 'my-dired)
#+end_src

* UI
** Theming
*** Modus
#+begin_src emacs-lisp :tangle my-modules/my-modus-theme.el
  ;; For packaged versions which must use `require'.
  (use-package modus-themes
    :ensure t
    :init
    (setq custom-safe-themes t)
    :config
    ;; Add all your customizations prior to loading the themes
    (setq modus-themes-italic-constructs t
          modus-themes-bold-constructs nil
          modus-themes-mixed-fonts t)

    ;; Maybe define some palette overrides, such as by using our presets
    (setq modus-themes-common-palette-overrides
          modus-themes-preset-overrides-intense)

     ;;;; Custom set faces - maybe seperate them out, if I do more customization.
    (set-face-attribute 'link nil
                      :weight 'regular)

    ;; Load the theme of your choice.
    (load-theme 'modus-operandi-tinted)

    (define-key global-map (kbd "<f5>") #'modus-themes-toggle)
    (setq modus-themes-to-toggle '(modus-operandi-tinted modus-vivendi-tinted))
    )
  (provide 'my-modus-theme)
#+end_src
*** Doom
#+begin_src emacs-lisp :tangle my-modules/my-doom-theme.el
;;;; Theming
;; (use-package doom-themes
;;   :ensure t
;;   :config
;;   ;; Global settings (defaults)
;;   (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
;;         doom-themes-enable-italic t) ; if nil, italics is universally disabled
;;   (load-theme 'doom-one t)

;;   ;; Enable flashing mode-line on errors
;;   (doom-themes-visual-bell-config)
;;   ;; Enable custom neotree theme (all-the-icons must be installed!)
;;   (doom-themes-neotree-config)
;;   ;; or for treemacs users
;;   (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
;;   (doom-themes-treemacs-config)
;;   ;; Corrects (and improves) org-mode's native fontification.
;;   (doom-themes-org-config))
#+end_src

** General theming

*** Highlight current line
#+begin_src emacs-lisp  :tangle my-modules/my-general-theming.el
  ;; Highlight current line
  (global-hl-line-mode 1)

#+end_src
*** Solaire
#+begin_src emacs-lisp :tangle my-modules/my-general-theming.el
  ;;;; Solaire mode
  ;; Make it easier to differentiate real buffers from less important.
  (use-package solaire-mode
    :init
    (solaire-global-mode +1))
#+end_src

