dot_config/emacs/my-modules/my-general-theming.el
;; Highlight current line
(global-hl-line-mode 1)

;;;; Solaire mode
;; Make it easier to differentiate real buffers from less important.
(use-package solaire-mode
  :init
  (solaire-global-mode +1))

;;;; Helpfull
