dot_config/emacs/config.org
*** Modeline faces
#+begin_src emacs-lisp :tangle my-modules/my-modeline.el

  ;;;; Faces

  (defface prot-modeline-indicator-button nil
    "Generic face used for indicators that have a background.
  Modify this face to, for example, add a :box attribute to all
  relevant indicators (combines nicely with my `spacious-padding'
  package).")

  (defface prot-modeline-indicator-red
    '((default :inherit bold)
      (((class color) (min-colors 88) (background light))
       :foreground "#880000")
      (((class color) (min-colors 88) (background dark))
       :foreground "#ff9f9f")
      (t :foreground "red"))
    "Face for modeline indicators (e.g. see my `notmuch-indicator')."
    :group 'prot-modeline-faces)

  (defface prot-modeline-indicator-red-bg
    '((default :inherit (bold prot-modeline-indicator-button))
      (((class color) (min-colors 88) (background light))
       :background "#aa1111" :foreground "white")
      (((class color) (min-colors 88) (background dark))
       :background "#ff9090" :foreground "black")
      (t :background "red" :foreground "black"))
    "Face for modeline indicators with a background."
    :group 'prot-modeline-faces)

  (defface prot-modeline-indicator-green
    '((default :inherit bold)
      (((class color) (min-colors 88) (background light))
       :foreground "#005f00")
      (((class color) (min-colors 88) (background dark))
       :foreground "#73fa7f")
      (t :foreground "green"))
    "Face for modeline indicators (e.g. see my `notmuch-indicator')."
    :group 'prot-modeline-faces)

  (defface prot-modeline-indicator-green-bg
    '((default :inherit (bold prot-modeline-indicator-button))
      (((class color) (min-colors 88) (background light))
       :background "#207b20" :foreground "white")
      (((class color) (min-colors 88) (background dark))
       :background "#77d077" :foreground "black")
      (t :background "green" :foreground "black"))
    "Face for modeline indicators with a background."
    :group 'prot-modeline-faces)

  (defface prot-modeline-indicator-yellow
    '((default :inherit bold)
      (((class color) (min-colors 88) (background light))
       :foreground "#6f4000")
      (((class color) (min-colors 88) (background dark))
       :foreground "#f0c526")
      (t :foreground "yellow"))
    "Face for modeline indicators (e.g. see my `notmuch-indicator')."
    :group 'prot-modeline-faces)

  (defface prot-modeline-indicator-yellow-bg
    '((default :inherit (bold prot-modeline-indicator-button))
      (((class color) (min-colors 88) (background light))
       :background "#805000" :foreground "white")
      (((class color) (min-colors 88) (background dark))
       :background "#ffc800" :foreground "black")
      (t :background "yellow" :foreground "black"))
    "Face for modeline indicators with a background."
    :group 'prot-modeline-faces)

  (defface prot-modeline-indicator-blue
    '((default :inherit bold)
      (((class color) (min-colors 88) (background light))
       :foreground "#00228a")
      (((class color) (min-colors 88) (background dark))
       :foreground "#88bfff")
      (t :foreground "blue"))
    "Face for modeline indicators (e.g. see my `notmuch-indicator')."
    :group 'prot-modeline-faces)

  (defface prot-modeline-indicator-blue-bg
    '((default :inherit (bold prot-modeline-indicator-button))
      (((class color) (min-colors 88) (background light))
       :background "#0000aa" :foreground "white")
      (((class color) (min-colors 88) (background dark))
       :background "#77aaff" :foreground "black")
      (t :background "blue" :foreground "black"))
    "Face for modeline indicators with a background."
    :group 'prot-modeline-faces)

  (defface prot-modeline-indicator-magenta
    '((default :inherit bold)
      (((class color) (min-colors 88) (background light))
       :foreground "#6a1aaf")
      (((class color) (min-colors 88) (background dark))
       :foreground "#e0a0ff")
      (t :foreground "magenta"))
    "Face for modeline indicators (e.g. see my `notmuch-indicator')."
    :group 'prot-modeline-faces)

  (defface prot-modeline-indicator-magenta-bg
    '((default :inherit (bold prot-modeline-indicator-button))
      (((class color) (min-colors 88) (background light))
       :background "#6f0f9f" :foreground "white")
      (((class color) (min-colors 88) (background dark))
       :background "#e3a2ff" :foreground "black")
      (t :background "magenta" :foreground "black"))
    "Face for modeline indicators with a background."
    :group 'prot-modeline-faces)

  (defface prot-modeline-indicator-cyan
    '((default :inherit bold)
      (((class color) (min-colors 88) (background light))
       :foreground "#004060")
      (((class color) (min-colors 88) (background dark))
       :foreground "#30b7cc")
      (t :foreground "cyan"))
    "Face for modeline indicators (e.g. see my `notmuch-indicator')."
    :group 'prot-modeline-faces)

  (defface prot-modeline-indicator-cyan-bg
    '((default :inherit (bold prot-modeline-indicator-button))
      (((class color) (min-colors 88) (background light))
       :background "#006080" :foreground "white")
      (((class color) (min-colors 88) (background dark))
       :background "#40c0e0" :foreground "black")
      (t :background "cyan" :foreground "black"))
    "Face for modeline indicators with a background."
    :group 'prot-modeline-faces)

  (defface prot-modeline-indicator-gray
    '((t :inherit shadow))
    "Face for modeline indicators (e.g. see my `notmuch-indicator')."
    :group 'prot-modeline-faces)

  (defface prot-modeline-indicator-gray-bg
    '((default :inherit (bold prot-modeline-indicator-button))
      (((class color) (min-colors 88) (background light))
       :background "#808080" :foreground "white")
      (((class color) (min-colors 88) (background dark))
       :background "#a0a0a0" :foreground "black")
      (t :inverse-video t))
    "Face for modeline indicatovrs with a background."
    :group 'prot-modeline-faces)

#+end_src
