dot_config/emacs/config.org
*** Modeline helper functions
#+begin_src emacs-lisp :tangle my-modules/my-modeline.el
    ;;;; Common helper functions

  (defun prot-common-window-narrow-p ()
    "Return non-nil if window is narrow.
  Check if the `window-width' is less than `split-width-threshold'."
    (and (numberp split-width-threshold)
         (< (window-total-width) split-width-threshold)))
  
    (defun prot-modeline--string-truncate-p (str)
      "Return non-nil if STR should be truncated."
      (if (string-empty-p str)
          str
        (and (prot-common-window-narrow-p)
             (> (length str) prot-modeline-string-truncate-length)
             (not (one-window-p :no-minibuffer)))))

    (defun prot-modeline--truncate-p ()
      "Return non-nil if truncation should happen.
    This is a more general and less stringent variant of
    `prot-modeline--string-truncate-p'."
      (and (prot-common-window-narrow-p)
           (not (one-window-p :no-minibuffer))))

    (defun prot-modeline-string-cut-end (str)
      "Return truncated STR, if appropriate, else return STR.
    Cut off the end of STR by counting from its start up to
    `prot-modeline-string-truncate-length'."
      (if (prot-modeline--string-truncate-p str)
          (concat (substring str 0 prot-modeline-string-truncate-length) "...")
        str))

    (defun prot-modeline-string-cut-beginning (str)
      "Return truncated STR, if appropriate, else return STR.
    Cut off the beginning of STR by counting from its end up to
    `prot-modeline-string-truncate-length'."
      (if (prot-modeline--string-truncate-p str)
          (concat "..." (substring str (- prot-modeline-string-truncate-length)))
        str))

    (defun prot-modeline-string-cut-middle (str)
      "Return truncated STR, if appropriate, else return STR.
    Cut off the middle of STR by counting half of
    `prot-modeline-string-truncate-length' both from its beginning
    and end."
      (let ((half (floor prot-modeline-string-truncate-length 2)))
        (if (prot-modeline--string-truncate-p str)
            (concat (substring str 0 half) "..." (substring str (- half)))
          str)))

    (defun prot-modeline--first-char (str)
      "Return first character from STR."
      (substring str 0 1))

    (defun prot-modeline-string-abbreviate (str)
      "Abbreviate STR individual hyphen or underscore separated words.
    Also see `prot-modeline-string-abbreviate-but-last'."
      (if (prot-modeline--string-truncate-p str)
          (mapconcat #'prot-modeline--first-char (split-string str "[_-]") "-")
        str))

    (defun prot-modeline-string-abbreviate-but-last (str nthlast)
      "Abbreviate STR, keeping NTHLAST words intact.
    Also see `prot-modeline-string-abbreviate'."
      (if (prot-modeline--string-truncate-p str)
          (let* ((all-strings (split-string str "[_-]"))
                 (nbutlast-strings (nbutlast (copy-sequence all-strings) nthlast))
                 (last-strings (nreverse (ntake nthlast (nreverse (copy-sequence all-strings)))))
                 (first-component (mapconcat #'prot-modeline--first-char nbutlast-strings "-"))
                 (last-component (mapconcat #'identity last-strings "-")))
            (if (string-empty-p first-component)
                last-component
              (concat first-component "-" last-component)))
        str))

#+end_src
