dot_config/emacs/config.org
*** Modeline code
#+begin_src emacs-lisp :tangle my-modules/my-modeline.el

    ;; My mode line with the `prot-modeline.el' 🤩
    ;; Note that separate to this is my `prot-modeline-subtle-mode'.
    (setq-default mode-line-format
                  '("%e"
                    prot-modeline-kbd-macro
                    prot-modeline-narrow
                    prot-modeline-buffer-status
                    " "
                    prot-modeline-buffer-identification
                    "  "
                    prot-modeline-major-mode
                    prot-modeline-process
                    "  "
                 ;;   prot-modeline-vc-branch
                    "  "
                    prot-modeline-flymake
                    "  "
                    prot-modeline-align-right
                    prot-modeline-misc-info))


  ;;;; Keyboard macro indicator

  (defvar-local prot-modeline-kbd-macro
      '(:eval
        (when (and (mode-line-window-selected-p) defining-kbd-macro)
          (propertize " KMacro " 'face 'prot-modeline-indicator-blue-bg)))
    "Mode line construct displaying `mode-line-defining-kbd-macro'.
  Specific to the current window's mode line.")


  ;;;; Narrow indicator

  (defvar-local prot-modeline-narrow
      '(:eval
        (when (and (mode-line-window-selected-p)
                   (buffer-narrowed-p)
                   (not (derived-mode-p 'Info-mode 'help-mode 'special-mode 'message-mode)))
          (propertize " Narrow " 'face 'prot-modeline-indicator-cyan-bg)))
    "Mode line construct to report the narrowed state of the current buffer.")

  ;;;; Remote status

  (defvar-local prot-modeline-buffer-status
      '(:eval
        (when (file-remote-p default-directory)
          (propertize " @ "
                      'face 'prot-modeline-indicator-red-bg
                      'mouse-face 'mode-line-highlight)))
    "Mode line construct for showing remote file name.")

  ;;;; Dedicated window

  (defvar-local prot-modeline-window-dedicated-status
      '(:eval
        (when (window-dedicated-p)
          (propertize " = "
                      'face 'prot-modeline-indicator-gray-bg
                      'mouse-face 'mode-line-highlight)))
    "Mode line construct for dedicated window indicator.")

  ;;;; Buffer name and modified status

  (defun prot-modeline-buffer-identification-face ()
    "Return appropriate face or face list for `prot-modeline-buffer-identification'."
    (let ((file (buffer-file-name)))
      (cond
       ((and (mode-line-window-selected-p)
             file
             (buffer-modified-p))
        '(italic mode-line-buffer-id))
       ((and file (buffer-modified-p))
        'italic)
       ((mode-line-window-selected-p)
        'mode-line-buffer-id))))

  (defun prot-modeline--buffer-name ()
    "Return `buffer-name', truncating it if necessary.
  See `prot-modeline-string-cut-middle'."
    (when-let* ((name (buffer-name)))
      (prot-modeline-string-cut-middle name)))

  (defun prot-modeline-buffer-name ()
    "Return buffer name, with read-only indicator if relevant."
    (let ((name (prot-modeline--buffer-name)))
      (if buffer-read-only
          (format "%s %s" (char-to-string #xE0A2) name)
        name)))

  (defun prot-modeline-buffer-name-help-echo ()
    "Return `help-echo' value for `prot-modeline-buffer-identification'."
    (concat
     (propertize (buffer-name) 'face 'mode-line-buffer-id)
     "\n"
     (propertize
      (or (buffer-file-name)
          (format "No underlying file.\nDirectory is: %s" default-directory))
      'face 'font-lock-doc-face)))

  (defvar-local prot-modeline-buffer-identification
      '(:eval
        (propertize (prot-modeline-buffer-name)
                    'face (prot-modeline-buffer-identification-face)
                    'mouse-face 'mode-line-highlight
                    'help-echo (prot-modeline-buffer-name-help-echo)))
    "Mode line construct for identifying the buffer being displayed.
  Propertize the current buffer with the `mode-line-buffer-id'
  face.  Let other buffers have no face.")

  ;;;; Major mode

  (defun prot-modeline-major-mode-indicator ()
    "Return appropriate propertized mode line indicator for the major mode."
    (let ((indicator (cond
                      ((derived-mode-p 'text-mode) "§")
                      ((derived-mode-p 'prog-mode) "λ")
                      ((derived-mode-p 'comint-mode) ">_")
                      (t "◦"))))
      (propertize indicator 'face 'shadow)))

  (defun prot-modeline-major-mode-name ()
    "Return capitalized `major-mode' without the -mode suffix."
    (capitalize (string-replace "-mode" "" (symbol-name major-mode))))

  (defun prot-modeline-major-mode-help-echo ()
    "Return `help-echo' value for `prot-modeline-major-mode'."
    (if-let* ((parent (get major-mode 'derived-mode-parent)))
        (format "Symbol: `%s'.  Derived from: `%s'" major-mode parent)
      (format "Symbol: `%s'." major-mode)))

  (defvar-local prot-modeline-major-mode
      (list
       (propertize "%[" 'face 'prot-modeline-indicator-red)
       '(:eval
         (concat
          (prot-modeline-major-mode-indicator)
          " "
          (propertize
           (prot-modeline-string-abbreviate-but-last
            (prot-modeline-major-mode-name)
            2)
           'mouse-face 'mode-line-highlight
           'help-echo (prot-modeline-major-mode-help-echo))))
       (propertize "%]" 'face 'prot-modeline-indicator-red))
    "Mode line construct for displaying major modes.")

  (defvar-local prot-modeline-process
      (list '("" mode-line-process))
    "Mode line construct for the running process indicator.")

  ;;;; Flymake errors, warnings, notes

  (declare-function flymake--severity "flymake" (type))
  (declare-function flymake-diagnostic-type "flymake" (diag))

  ;; Based on `flymake--mode-line-counter'.
  (defun prot-modeline-flymake-counter (type)
    "Compute number of diagnostics in buffer with TYPE's severity.
  TYPE is usually keyword `:error', `:warning' or `:note'."
    (let ((count 0))
      (dolist (d (flymake-diagnostics))
        (when (= (flymake--severity type)
                 (flymake--severity (flymake-diagnostic-type d)))
          (cl-incf count)))
      (when (cl-plusp count)
        (number-to-string count))))

  (defvar prot-modeline-flymake-map
    (let ((map (make-sparse-keymap)))
      (define-key map [mode-line down-mouse-1] 'flymake-show-buffer-diagnostics)
      (define-key map [mode-line down-mouse-3] 'flymake-show-project-diagnostics)
      map)
    "Keymap to display on Flymake indicator.")

  (defmacro prot-modeline-flymake-type (type indicator &optional face)
    "Return function that handles Flymake TYPE with stylistic INDICATOR and FACE."
    `(defun ,(intern (format "prot-modeline-flymake-%s" type)) ()
       (when-let* ((count (prot-modeline-flymake-counter
                           ,(intern (format ":%s" type)))))
         (concat
          (propertize ,indicator 'face 'shadow)
          (propertize count
                      'face ',(or face type)
                      'mouse-face 'mode-line-highlight
                      ;; FIXME 2023-07-03: Clicking on the text with
                      ;; this buffer and a single warning present, the
                      ;; diagnostics take up the entire frame.  Why?
                      'local-map prot-modeline-flymake-map
                      'help-echo "mouse-1: buffer diagnostics\nmouse-3: project diagnostics")))))

  (prot-modeline-flymake-type error "☣")
  (prot-modeline-flymake-type warning "!")
  (prot-modeline-flymake-type note "·" success)

  (defvar-local prot-modeline-flymake
      `(:eval
        (when (and (bound-and-true-p flymake-mode)
                   (mode-line-window-selected-p))
          (list
           ;; See the calls to the macro `prot-modeline-flymake-type'
           '(:eval (prot-modeline-flymake-error))
           '(:eval (prot-modeline-flymake-warning))
           '(:eval (prot-modeline-flymake-note)))))
    "Mode line construct displaying `flymake-mode-line-format'.
  Specific to the current window's mode line.")


  ;;;; Eglot

  (with-eval-after-load 'eglot
    (setq mode-line-misc-info
          (delete '(eglot--managed-mode (" [" eglot--mode-line-format "] ")) mode-line-misc-info)))

  (defvar-local prot-modeline-eglot
      `(:eval
        (when (and (featurep 'eglot) (mode-line-window-selected-p))
          '(eglot--managed-mode eglot--mode-line-format)))
    "Mode line construct displaying Eglot information.
  Specific to the current window's mode line.")


  ;;;; Miscellaneous

  (defvar-local prot-modeline-misc-info
      '(:eval
        (when (mode-line-window-selected-p)
          mode-line-misc-info))
    "Mode line construct displaying `mode-line-misc-info'.
  Specific to the current window's mode line.")

  ;;;; Risky local variables

  ;; NOTE 2023-04-28: The `risky-local-variable' is critical, as those
  ;; variables will not work without it.
  (dolist (construct '(prot-modeline-kbd-macro
                       prot-modeline-narrow
                       prot-modeline-input-method
                       prot-modeline-buffer-status
                       prot-modeline-window-dedicated-status
                       prot-modeline-buffer-identification
                       prot-modeline-major-mode
                       prot-modeline-process
                       prot-modeline-vc-branch
                       prot-modeline-flymake
                       prot-modeline-eglot
                       ;; prot-modeline-align-right
                       prot-modeline-notmuch-indicator
                       prot-modeline-misc-info))
    (put construct 'risky-local-variable t))


  ;;; Modeline format
    ;; (setq-default mode-line-format
    ;;               '("%e"
    ;;                 my-modeline-buffer-name
    ;;                 "  "
    ;;                 my-modeline-major-mode))

    ;; (defface my-modeline-background
    ;;   '((t :background "#3355bb" :foreground "white" :inherit bold))
    ;;   "Face with a red background for use on the mode line.")

    ;; ;; Buffer name
    ;; (defun my-modeline--buffer-name ()
    ;;   "Return `buffer-name' with spaces around it."
    ;;   (format " %s " (buffer-name)))

    ;; (defvar-local my-modeline-buffer-name
    ;;     '(:eval
    ;;       (when (mode-line-window-selected-p)
    ;;         (propertize (my-modeline--buffer-name) 'face 'my-modeline-background)))
    ;;   "Mode line construct to display the buffer name.")

    ;; ;; Major mode name
    ;; (defun my-modeline--major-mode-name ()
    ;;   "Return capitalized `major-mode' as a string."
    ;;   (capitalize (symbol-name major-mode)))

    ;; (defvar-local my-modeline-major-mode
    ;;     '(:eval
    ;;       (list
    ;;        (propertize "λ" 'face 'shadow)
    ;;        " "
    ;;        (propertize (my-modeline--major-mode-name) 'face 'bold)))
    ;;   "Mode line construct to display the major mode.")

    ;; ;; Risky local variable for each term to show up in modeline.
    ;; (dolist (construct '(my-modeline-major-mode
    ;;                      my-modeline-buffer-name))
    ;; (put construct 'risky-local-variable t))

    ;; Emacs 29, check the definition right below
    ;; (mode-line-window-selected-p)

    (defun mode-line-window-selected-p ()
      "Return non-nil if we're updating the mode line for the selected window.
    This function is meant to be called in `:eval' mode line
    constructs to allow altering the look of the mode line depending
    on whether the mode line belongs to the currently selected window
    or not."
      (let ((window (selected-window)))
        (or (eq window (old-selected-window))
        (and (minibuffer-window-active-p (minibuffer-window))
             (with-selected-window (minibuffer-window)
               (eq window (minibuffer-selected-window)))))))

    (provide 'my-modeline)
#+end_src
