dot_config/emacs/config.org
*** Doom modeline
A simple version of doom modeline I used before
#+begin_src emacs-lisp :tangle my-modules/my-doom-modeline.el
  ;;;; Show battery and time
  (display-time-mode 1)              ; Enable time in the mode-line
  (setq display-time-24hr-format t)
  (display-battery-mode 0)           ; it's nice to know how much power you have

  ;;;; Modeline
   (use-package doom-modeline
     :init
     ;; Whether to use hud instead of default bar. It's only respected in GUI.
     (setq doom-modeline-hud t)
     (setq doom-modeline-buffer-encoding nil) ; No UTF-8 info in bar
     (setq doom-modeline-buffer-modification-icon nil)
     (setq doom-modeline-display-misc-in-all-mode-lines nil)
     (setq doom-modeline-percent-position nil)
     (setq line-number-mode nil)
     (setq column-number-mode nil)
     (setq display-time-default-load-average nil) ;; Remove load average from bar

     :custom
     (doom-modeline-mode 1)

       )

   (provide 'my-doom-modeline)
#+end_src
* Editor
** Typo, line width...
#+begin_src emacs-lisp :tangle my-modules/my-editor-settings.el
;;;; Typo? and line wrapping
(setq-default fill-column 80                          ; Default line width 
              sentence-end-double-space nil           ; Use a single space after dots
                                        ;                bidi-paragraph-direction 'left-to-right ; Faster
              truncate-string-ellipsis "…")           ; Nicer ellipsis

;; This snippet has something to do with where the underline is places. I trust Nicholas from Nano, check out the variable documentation.
(setq x-underline-at-descent-line nil
      x-use-underline-position-properties t
      underline-minimum-offset 10)

#+end_src
