dot_config/emacs/my-modules/my-editor-settings.el
;;;; Typo? and line wrapping
(setq-default fill-column 80                          ; Default line width 
              sentence-end-double-space nil           ; Use a single space after dots
                                        ;                bidi-paragraph-direction 'left-to-right ; Faster
              truncate-string-ellipsis "…")           ; Nicer ellipsis

;; This snippet has something to do with where the underline is places. I trust Nicholas from Nano, check out the variable documentation.
(setq x-underline-at-descent-line nil
      x-use-underline-position-properties t
      underline-minimum-offset 10)

;;;; Jump
  ;;;;; Avy
  (use-package avy
