dot_config/emacs/config.org
** Better coding experience
#+begin_src emacs-lisp :tangle my-modules/my-editor-settings.el
;;;; Electric pair mode
(electric-pair-mode 1)

  
  ;;;; Outline mode
  ;; Built in package, that works quite nice. Maybe some day check out ts-fold based on tree-sitter: https://github.com/emacs-tree-sitter/ts-fold?tab=readme-ov-file#ts-fold
  ;; This reddit thread have more inspiration for further keybindings.
  (use-package outline
    :hook (prog-mode . outline-minor-mode)
    :config
    (setq outline-minor-mode-use-buttons t)
    (setq outline-minor-mode-highlight nil) ;; Check this out.
    :bind-keymap ("C-c C-o" . outline-mode-prefix-map)
    ;; :bind (:map outline-minor-mode-map
    ;;             ([C-tab] . bicycle-cycle)
    ;;             ("<backtab>" . bicycle-cycle-global))
    )

  ;; For now I have converted to outli - I think I like it better.
  (use-package outli
    :vc (:fetcher github
                  :repo "jdtsmith/outli")
    :hook ((prog-mode text-mode) . outli-mode))

  (use-package ts-fold
      :vc (:fetcher github
                  :repo "emacs-tree-sitter/ts-fold"))
(provide 'my-editor-settings)
#+end_src
* Tabs, projects and bookmarks
#+begin_src emacs-lisp :tangle my-modules/my-workspace.el
;;;; Writeroom mode
;; For better focus
(use-package writeroom-mode
  :defer 3
  :bind
  ("<f8>" . 'writeroom-mode)
  )

  
  ;;;; tabs, projects etc.
  ;;Der er flere indbyggede pakker, som delvist overlapper.
  ;; - desktop.el :: Kan gemme og senere hente window samt tab, og buffer åbne på et bestemt tidspunkt. Kan gøres automatisk når emacs åbnes og lukkes.
  ;; - bookmark :: bookmark a specific file
  ;; - project.el :: project management
  ;; - tab-bar-mode :: Giver en slags tabs, over window layout med buffere
  ;; - tab-line-mode :: Giver en slags tabs, over hvilke buffere som har været åbne i et enkelt vindue
  (use-package tab-bar
    :config
    (setq tab-bar-select-tab-modifiers 't)
    (tab-bar-history-mode 1)
     )

  ;;;; Bookmark plus
  (use-package bookmark+
    :vc (:fetcher github
                  :repo "emacsmirror/bookmark-plus")
    ;;		  :main "bookmark+.el")
    :ensure t)
(provide 'my-workspace)
#+end_src
* Frames and windows
I need to think about frames and windows. Stuff like window redo, save to register etc. Also kind of emacs everywhere pop up frames with org-capture etc. 
* Spelling
Spelling and grammar
#+begin_src emacs-lisp :tangle my-modules/my-spelling.el
;;;; Spelling
(use-package jinx
  :hook (emacs-startup . global-jinx-mode)
  :bind (("<f7>" . jinx-correct)
         ("S-<f7>" . jinx-languages))
  :init
  (setq jinx-languages '"en_US")
  ;; (add-to-list 'vertico-multiform-categories
  ;;          '(jinx grid (vertico-grid-annotate . 20)))
  ;; (vertico-multiform-mode 1)
  )

;;;; Grammar

;;   Maybe also check out writegood mode
;; There are two packages that doom emacs use for grammar checking. One of them can also be used online to check for example a manuscript.
;; Languagetool and writegood mode.
;; Remember to install languagetool.

(use-package writegood-mode
  :bind ("C-C g" . writegood-mode))

(use-package langtool
  :defer t)
(setq langtool-java-classpath
      "/usr/share/languagetool:/usr/share/java/languagetool/*")
(bind-keys
 :prefix-map languagetool-map
 :prefix "C-c l")
(bind-keys :map languagetool-map
           ("c" . langtool-interarctive-correction)
           ("d" . langtool-check-done)
           ("h" . langtool-show-message-at-point)
           ("l" . langtool-check)
           )
(provide 'my-spelling)
#+end_src
