dot_config/emacs/my-modules/my-editor-settings.el

;;;; Electric pair mode
(electric-pair-mode 1)

  
  ;;;; Outline mode
  ;; Built in package, that works quite nice. Maybe some day check out ts-fold based on tree-sitter: https://github.com/emacs-tree-sitter/ts-fold?tab=readme-ov-file#ts-fold
  ;; This reddit thread have more inspiration for further keybindings.
  (use-package outline
    :hook (prog-mode . outline-minor-mode)
    :config
    (setq outline-minor-mode-use-buttons t)
    (setq outline-minor-mode-highlight nil) ;; Check this out.
    :bind-keymap ("C-c C-o" . outline-mode-prefix-map)
    ;; :bind (:map outline-minor-mode-map
    ;;             ([C-tab] . bicycle-cycle)
    ;;             ("<backtab>" . bicycle-cycle-global))
    )

  ;; For now I have converted to outli - I think I like it better.
  (use-package outli
    :vc (:fetcher github
                  :repo "jdtsmith/outli")
    :hook ((prog-mode text-mode) . outli-mode))

  (use-package ts-fold
      :vc (:fetcher github
                  :repo "emacs-tree-sitter/ts-fold"))
(provide 'my-editor-settings)
