dot_config/emacs/config.org
* Minibuffer
#+begin_src emacs-lisp :tangle my-modules/my-minibuffer.el
  ;;;; Minibuffer
  ;;;;; Vertico
  ;; Enable vertico - Shows xx possible lines in minibuffer.
  (use-package vertico
    :init
    (vertico-mode)
    (setq vertico-cycle t
          vertico-count-format nil ; No prefix with number of entries
          vertico-count 7) ; Number of occurences to show in the minibuffer.
    (add-hook 'rfn-eshadow-update-overlay-hook #'vertico-directory-tidy) ; Makes it more tidy when using ~/ completion in find-file.
    )

  ;; Persist history over Emacs restarts. Vertico sorts by history position.
  (use-package savehist
    :init
    (savehist-mode))
  ;;;;; Marginalia 
  ;; Enable rich annotations using the Marginalia package in minibuffer.
  (use-package marginalia
    ;; Bind `marginalia-cycle' locally in the minibuffer.  To make the binding
    ;; available in the *Completions* buffer, add it to the
    ;; `completion-list-mode-map'.
    :bind (:map minibuffer-local-map
                ("M-A" . marginalia-cycle))

    ;; The :init section is always executed.
    :init
    ;; Marginalia must be activated in the :init section of use-package such that
    ;; the mode gets enabled right away. Note that this forces loading the
    ;; package.
    (marginalia-mode))

  (provide 'my-minibuffer)
#+end_src
* User info
#+begin_src emacs-lisp :tangle my-modules/my-user-info.el
  ;; Some functionality uses this to identify you, e.g. GPG configuration, email
  ;; clients, file templates and snippets.
  (setq user-full-name "Kristian Bagge"
        user-mail-address "mail@kristianbagge.com")
  (setq org-crypt-key "mail@kristianbagge.com")

  ;;; GPG & Authinfo
  (require 'epg)
                                          ;(setqq epg-pinentry-mode 'loopback)
  (setq epg-user-id "mail@kristianbagge.com")
  (setq epa-file-encrypt-to "mail@kristianbagge.com")
  (setq epa-file-select-keys t)
  (setq epg-gpg-home-directory "~/.config/gnupg/")

  (setq epg-debug t)
  (setq auth-source-debug t)
  (setq auth-info-debug t)
  ;;(setq epa-file-cache-passphrase-for-symmetric-encryption 't) ; This might save me from typing the pin on yubikey many times in the same session
                                          ; The above solved it. I have kept the below just in case I need to experiment with it in the future.
                                          ;(setenv "GPG_AGENT_INFO" nil) ; Make sure emacs don't use any external pinentry. Not sure if this will affect my gpg ssh setup.

  ;; Emacs have a way of saving secrets in a PGP encrypted file and retrieve them later. I have set this to ~/.authinfo.gpg
  ;; Some good sources:
  ;; - [[https://www.masteringemacs.org/article/keeping-secrets-in-emacs-gnupg-auth-sources][Mastering emacs - auth sources]]
  ;; - [[https://www.gnu.org/software/emacs/manual/html_mono/auth.html][Emacs manual - auth sources]]
  ;; - [[https://github.com/daviwil/emacs-from-scratch/blob/master/show-notes/Emacs-Tips-Pass.org][Emacs from scratch - auth sources]]
  (setq auth-sources '("~/.authinfo")
        auth-source-cache-expiry nil) ; default is 7200 (2h)

  ;; Passwords
  (setq password-cache-expiry nil
        password-cache t
        plstore-cache-passphrase-for-symmetric-encryption t ; This makes org-caldav cache passwords. The default is not.
  )
(provide 'my-user-info)
#+end_src
* Org
#+begin_src emacs-lisp :tangle my-modules/my-org-setup.el
  ;;; Org mode
  ;;;; Org variables
  ;; Define new variables to call later
  (setq +org-dir (concat (getenv "HOME") "/org/")
        +agenda-dir (concat +org-dir "agenda/")
        +org-image-dir "~/Library/Images/"
        +library-notes (concat +org-dir "library-notes/")
        +bibtex-file '("~/org/library-notes/My_Library.bib")
        +org-projects-todo-file (concat +agenda-dir "20231227T222442--projects__agenda_projects.org")
        +org-capture-recipies-file  (concat +org-dir "20240102T010106--kogebog__mad.org")
        +org-capture-inbox (concat +agenda-dir "20231226T221108--inbox__agenda_inbox.org"))
  ;; Set org-dir and org-archive location
  (setq org-directory +org-dir
        org-archive-location (concat +org-dir "archive.org_archive::* From %s"))

  (use-package org
    :init
    ;; UI interface
    (setq org-hide-emphasis-markers t)
    (setq org-pretty-entities t)
    (setq org-startup-indented t)
    (setq org-pretty-entities-include-sub-superscripts nil)
    (setq org-startup-folded "show1levels")
    ;; Use RET to open org-mode links, including those in quick-help.org
    (setq org-return-follows-link t)

    :custom
    (require 'org-crypt)
    (setq org-tags-exclude-from-inheritance
          '("crypt"))
    (set-face-attribute 'org-table nil :inherit 'fixed-pitch) ;; Make tables use fixed pitch
    :hook (org-mode . visual-line-mode)
    (org-mode . variable-pitch-mode)
    :bind
    ("C-c c" . org-capture)
    ("C-c a" . org-agenda)
    (:map my-open-map
          ("a" . org-agenda))
    )

  (use-package org-modern
    :after org
    :config
    (global-org-modern-mode)
    :init
    ;; (setq org-modern-timestamp '(" %A, %b %e - %Y " . " %H:%M "))
    (setq org-modern-timestamp nil)
    (setq org-modern-block-fringe 1)
    (setq org-modern-table nil)
    (setq org-modern-star '("✳" "○" "◉" "◇" "◈"))
    )

  (setq org-todo-keywords
        '((sequence
           "TODO"  ; A task that needs doing & is ready to do
           "STARTED(!)" ; Something I started on ! Means the time started is logged in txt.
           "|"
           "DONE"  ; Task successfully completed
           "CANCELED" ; Explains itself - used before archiving.
           )))

  (setq org-todo-keyword-faces
        '(("TODO" . org-warning) ("STARTED" . "yellow")
          ("CANCELED" . (:foreground "blue" :weight bold))))

  (setq org-tag-persistent-alist '(("work" . ?w) ("home" . ?h) ("@online" . ?o) ("@møde" . ?m) ("@errand" . ?e) ("@phone" . ?p) (:newline)
                                   ("blocked" .?b) ("someday" .?s) (:newline)
                                   ("anders" . ?A) ("simone" .?S) ("maria" . ?M) ))
  (setq org-special-ctrl-a/e t)

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp - t)
     (python . t)))
  (setq org-confirm-babel-evaluate nil)

  (use-package org-pomodoro)
  (setq org-pomodoro-manual-break t)

  (use-package org-download
    :after org
    :init
    (setq org-attach-id-dir (file-name-as-directory(concat +org-dir "data"))
          org-download-image-dir +org-image-dir
          org-image-actual-width (/ (display-pixel-width) 3) ; vil gøre alle billeders bredde svarende til 1/3 af skærmen.
                                          ;org-image-actual-width '(300) ; vil gøre alle billeder 300 pixel bredde
          org-startup-with-inline-images t ;; gør nok org lidt langsommere, men jeg bruger det i mange af mine noter.
          org-link-abbrev-alist '(("image-file" . "~/Library/Images/%s")
                                  ("wikipedia" . "https://en.wikipedia.org/wiki/%s")
                                  ("duckduckgo" . "https://duckduckgo.com/?q=%s")
                                  ("gmap" . "https://maps.google.com/maps?q=%s")
                                  ("gimages" . "https://google.com/images?q=%s")
                                  ("google" . "https://google.com/search?q=")
                                  ("youtube" . "https://youtube.com/watch?v=%s")
                                  ("github" . "https://github.com/%s"))
          ))

;;;; Math latex in org-mode inline
(use-package org-fragtog
  :custom
  ;; Math looks small in org-mode - lets make latex fragments bagger
  (setq org-format-latex-options (plist-put org-format-latex-options :scale 2.0))
  :hook (org-mode . org-fragtog-mode)
  )

#+end_src
