dot_config/emacs/my-modules/my-org-setup.el
;;; Org mode
  ;;;; Org variables
  ;; Define new variables to call later
  (setq +org-dir (concat (getenv "HOME") "/org/")
        +agenda-dir (concat +org-dir "agenda/")
        +org-image-dir "~/Library/Images/"
        +library-notes (concat +org-dir "library-notes/")
        +bibtex-file '("~/org/library-notes/My_Library.bib")
        +org-projects-todo-file (concat +agenda-dir "20231227T222442--projects__agenda_projects.org")
        +org-capture-recipies-file  (concat +org-dir "20240102T010106--kogebog__mad.org")
        +org-capture-inbox (concat +agenda-dir "20231226T221108--inbox__agenda_inbox.org"))
  ;; Set org-dir and org-archive location
  (setq org-directory +org-dir
        org-archive-location (concat +org-dir "archive.org_archive::* From %s"))

  (use-package org
    :init
    ;; UI interface
    (setq org-hide-emphasis-markers t)
    (setq org-pretty-entities t)
    (setq org-startup-indented t)
    (setq org-pretty-entities-include-sub-superscripts nil)
    (setq org-startup-folded "show1levels")
    ;; Use RET to open org-mode links, including those in quick-help.org
    (setq org-return-follows-link t)

    :custom
    (require 'org-crypt)
    (setq org-tags-exclude-from-inheritance
          '("crypt"))
    (set-face-attribute 'org-table nil :inherit 'fixed-pitch) ;; Make tables use fixed pitch
    :hook (org-mode . visual-line-mode)
    (org-mode . variable-pitch-mode)
    :bind
    ("C-c c" . org-capture)
    ("C-c a" . org-agenda)
    (:map my-open-map
          ("a" . org-agenda))
    )

  (use-package org-modern
    :after org
    :config
    (global-org-modern-mode)
    :init
    ;; (setq org-modern-timestamp '(" %A, %b %e - %Y " . " %H:%M "))
    (setq org-modern-timestamp nil)
    (setq org-modern-block-fringe 1)
    (setq org-modern-table nil)
    (setq org-modern-star '("✳" "○" "◉" "◇" "◈"))
    )

  (setq org-todo-keywords
        '((sequence
           "TODO"  ; A task that needs doing & is ready to do
           "STARTED(!)" ; Something I started on ! Means the time started is logged in txt.
           "|"
           "DONE"  ; Task successfully completed
           "CANCELED" ; Explains itself - used before archiving.
           )))

  (setq org-todo-keyword-faces
        '(("TODO" . org-warning) ("STARTED" . "yellow")
          ("CANCELED" . (:foreground "blue" :weight bold))))

  (setq org-tag-persistent-alist '(("work" . ?w) ("home" . ?h) ("@online" . ?o) ("@møde" . ?m) ("@errand" . ?e) ("@phone" . ?p) (:newline)
                                   ("blocked" .?b) ("someday" .?s) (:newline)
                                   ("anders" . ?A) ("simone" .?S) ("maria" . ?M) ))
  (setq org-special-ctrl-a/e t)

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp - t)
     (python . t)))
  (setq org-confirm-babel-evaluate nil)

  (use-package org-pomodoro)
  (setq org-pomodoro-manual-break t)

  (use-package org-download
    :after org
    :init
    (setq org-attach-id-dir (file-name-as-directory(concat +org-dir "data"))
          org-download-image-dir +org-image-dir
          org-image-actual-width (/ (display-pixel-width) 3) ; vil gøre alle billeders bredde svarende til 1/3 af skærmen.
                                          ;org-image-actual-width '(300) ; vil gøre alle billeder 300 pixel bredde
          org-startup-with-inline-images t ;; gør nok org lidt langsommere, men jeg bruger det i mange af mine noter.
          org-link-abbrev-alist '(("image-file" . "~/Library/Images/%s")
                                  ("wikipedia" . "https://en.wikipedia.org/wiki/%s")
                                  ("duckduckgo" . "https://duckduckgo.com/?q=%s")
                                  ("gmap" . "https://maps.google.com/maps?q=%s")
                                  ("gimages" . "https://google.com/images?q=%s")
                                  ("google" . "https://google.com/search?q=")
                                  ("youtube" . "https://youtube.com/watch?v=%s")
                                  ("github" . "https://github.com/%s"))
          ))

;;;; Math latex in org-mode inline
(use-package org-fragtog
  :custom
  ;; Math looks small in org-mode - lets make latex fragments bagger
  (setq org-format-latex-options (plist-put org-format-latex-options :scale 2.0))
  :hook (org-mode . org-fragtog-mode)
  )
