dot_config/emacs/my-modules/my-org-setup.el

(use-package org-super-agenda
  :hook (org-agenda-mode . org-super-agenda-mode))

(setq org-agenda-files (directory-files-recursively +agenda-dir ".*\.org")
      org-agenda-dim-blocked-tasks nil  ; The following are supposed to speed up org-agenda when it gets slow - see https://orgmode.org/worg/agenda-optimization.html -- check the documentation, I don't need it.
      ;; org-agenda-inhibit-startup t   ; agenda doesnt respect folding, making it faster. <- disabled for now since it might not be neccessary.
      org-agenda-skip-scheduled-if-done t
      org-agenda-skip-deadline-if-done t
      org-agenda-skip-scheduled-if-deadline-is-shown t
      org-agenda-include-deadlines t
      org-deadline-warning-days 7 ; for the calendar view
      org-agenda-todo-ignore-deadline 14 ; for the todo list
      org-agenda-todo-ignore-scheduled 7 ; use less warning days for scheduled tasks
      org-agenda-start-day "+0d"
      org-agenda-block-separator nil
      org-agenda-tags-column 100 ;; from testing this seems to be a good value
      org-agenda-compact-blocks t
      org-log-done 'time ;; puts a time log on when an item was marked as done
      ;;      org-agenda-hide-tags-regexp (regexp-opt '("no_roam"))

      org-agenda-prefix-format ;; Remove the file coloumn in the agenda and todo view
      '((agenda . " %i %?-12t% s")
        (todo   . " %i %s")
        (tags   . " %i ")
        (search . " %i %-12:c"))
      )

;; The custom agenda command follows below - maybe one day make more for different purposes
(setq  org-agenda-custom-commands
       '(("o" "Overview"
          ((agenda "" ((org-agenda-format-date (format-time-string "%A     %e %B %Y  --  (uge %W)" (current-time)))
                       (org-agenda-span 1)
                       (org-agenda-include-deadlines nil)
                       (org-habit-show-habits-only-for-today nil)
                       (org-super-agenda-groups
                        '((:name "Today"
                                 :time-grid t
                                 :date today
                                 :todo "TODO"
                                 :scheduled past
                                 :order 1)))))
           (agenda "" ((org-agenda-span 1)
                       (org-agenda-format-date "")
                       (org-agenda-start-day "+1d")
                       (org-habit-show-habits-only-for-today nil)
                       (org-agenda-include-deadlines nil)
                       (org-agenda-use-time-grid nil)
                       (org-super-agenda-groups
                        '((:name "Tomorrow:"
                                 :date today
                                 :deadline nil
                                 :scheduled past
                                 :order 1)))))
           (agenda "" ((org-agenda-format-date "")
                       (org-agenda-span 1)
                       (org-agenda-use-time-grid nil)
                       (org-agenda-todo-ignore-deadlines 'far)
                       (org-super-agenda-groups
                        '((:name "Deadlines:"
                                 :deadline t
                                 :discard (:anything t)
                                 :order 1)))))
           (alltodo "" ((org-agenda-overriding-header "")
                        (org-agenda-tag-filter-preset '("-someday"))
                        (org-super-agenda-groups
                         '((:name "In Process"
                                  :todo "STARTED"
                                  :discard (:habit t)
                                  :order 1)
                           (:name "Due Today"
                                  :deadline today
                                  :discard (:todo "[ ]")
                                  :order 2)
                           (:name "Top priority"
                                  ;;                             :tag "Important"
                                  :priority "A"
                                  :order 6)
                           (:name "Quick tasks"
                                  :and(:effort< "0:05" :not (:tag "blocked"))
                                  :order 7)
                           (:name "Work"
                                  :and (:tag "work" :todo "TODO" :not (:tag "mail") :not(:tag "blocked") :not(:tag "ykm"))
                                  :order 10)
                           (:name "YKM"
                                  :tag "ykm"
                                  :order 11)
                           (:name "Personal"
                                  :and (:tag "me" :not (:tag "blocked"))
                                  :order 12)
                           (:name "Mail"
                                  :tag "mail"
                                  :order 13)
                           (:name "Projects"
                                  :and (:todo "TODO" :tag "project" :not (:tag "emacs") :not(:tag "blocked"))
                                  :order 14)
                           (:name "Research"
                                  :and (:tag "research" :todo "TODO" :not(:tag "blocked"))
                                  :order 15)
                           (:name "To read"
                                  :tag "read"
                                        ;                               :todo "TODO"
                                  :order 30)
                           (:name "emacs"
                                  :tag "emacs"
                                  :order 40)
                           (:name "Linux"
                                  :and (:tag "arch"
                                             :todo "TODO")
                                  :order 50)
                           (:name "Other items"
                                  :not (:tag "blocked")
                                  :order 55)
                           (:name "Blocked Tasks"
                                  :tag "blocked"
                                  :order 60)
                           ))))
           ))))

;;; Org capture
