dot_config/emacs/config.org
* Denote
#+begin_src emacs-lisp :tangle my-modules/my-denote-setup.el
  ;;; Denote
  (unless (package-installed-p 'denote)
    (package-install 'denote))

  ;; Denote
  (use-package denote
    :init
    (require 'denote-org-extras)
    (require 'denote-journal-extras)
    (denote-rename-buffer-mode t)
    (setq denote-journal-extras-title-format 'day-date-month-year)
    :custom
    (denote-directory "~/org/")

    :hook
    (dired-mode . denote-dired-mode)
    :custom-face
    (denote-faces-link ((t (:slant italic))))
    :bind (:map my-notes-map
                ("n" . denote-create-note)
                ("j" . denote-journal-extras-new-or-existing-entry)
                ("i" . denote-link-or-create)
                ("f" . denote-open-or-create)
                ("l" . denote-find-link)
                ("b" . denote-find-backlink)
                ("D" . denote-org-dblock-insert-links)
                ("r" . denote-rename-file-using-front-matter)
                ("R" . denote-rename-file)
                ("s" . denote-subdirectory)
                ("S" . my-denote-region-subdirectory)
                ("k" . denote-keywords-add)
                ("K" . denote-keywords-remove))
  )

  (defun my/denote-copy-todo-to-today ()
    (interactive)
    (let ((org-refile-keep nil) ;; Set this to nil to delete the original!
          (org-after-refile-insert-hook #'save-buffer)
          today-file
          pos)
      (save-window-excursion
        (denote-journal-extras-new-or-existing-entry)
        (setq today-file (buffer-file-name))
        (setq pos (point)))

      ;; Only refile if the target file is different than the current file
      (unless (equal (file-truename today-file)
                     (file-truename (buffer-file-name)))
        (org-refile nil nil (list "Tasks:" today-file nil pos)))))

  (add-to-list 'org-after-todo-state-change-hook
               (lambda ()
                 (when (equal org-state "DONE")
                   (my/denote-copy-todo-to-today))))

  (use-package consult-denote
    :init
    (consult-denote-mode 1)
    )

  (provide 'my-denote-setup)
#+end_src

* Citar
#+begin_src emacs-lisp :tangle my-modules/my-citar-setup.el
  ;;; Citar
  (use-package citar
    :bind (:map org-mode-map
                ("C-c b" . org-cite-insert)
                (:map my-insert-map
                      ("b" . org-cite-insert)))
    :custom
    (citar-bibliography '("~/bib/references.bib"))
    (defvar citar-indicator-files-icons
      (citar-indicator-create
       :symbol (nerd-icons-faicon
                "nf-fa-file_pdf_o"
                :face 'nerd-icons-green
                :v-adjust -0.05)
       :function #'citar-has-files
       :padding "  " ; need this because the default padding is too low for these icons
       :tag "has:files"))

    (defvar citar-indicator-links-icons
      (citar-indicator-create
       :symbol (nerd-icons-codicon
                "nf-cod-link"
                :face 'nerd-icons-orange
                :v-adjust 0.01)
       :function #'citar-has-links
       :padding "  "
       :tag "has:links"))

    (defvar citar-indicator-notes-icons
      (citar-indicator-create
       :symbol (nerd-icons-codicon
                "nf-cod-notebook"
                :face 'nerd-icons-blue
                :v-adjust -0.05)
       :function #'citar-has-notes
       :padding "  "
       :tag "has:notes"))

    (defvar citar-indicator-cited-icons
      (citar-indicator-create
       :symbol (nerd-icons-faicon
                "nf-fa-quote_right"
                :face 'nerd-icons-green)
       :function #'citar-is-cited
       :padding "  "
       :tag "is:cited"))

    (setq citar-indicators
          (list citar-indicator-files-icons
                citar-indicator-links-icons
                citar-indicator-notes-icons
                citar-indicator-cited-icons))
    :hook
    (LaTeX-mode . citar-capf-setup)
    (org-mode . citar-capf-setup)
    :init
    (setq org-cite-global-bibliography +bibtex-file
          org-cite-insert-processor 'citar
          org-cite-follow-processor 'citar
          org-cite-activate-processor 'citar
          org-cite-csl-styles-dir "~/Zotero/styles"
          citar-bibliography org-cite-global-bibliography
          notes-paths (if (stringp +library-notes) (list +library-notes) +library+notes)
          ))

  (unless (package-installed-p 'citar-embark)
    (package-install 'citar-embark))

  (use-package citar-embark
    :after citar embark
    :no-require
    :init
    ;; Open embark with enter.
    (setq citar-at-point-function 'embark-act)
    :config (citar-embark-mode))

  (unless (package-installed-p 'citar-denote)
    (package-install 'citar-denote))

  (use-package citar-denote
    :custom
    ;; Allow multiple notes per bibliographic entry
    (citar-open-always-create-notes nil)
    ;; Use package defaults
    (citar-denote-file-type 'org)
    (citar-denote-subdir nil)
    (citar-denote-signature nil)
    (citar-denote-template nil)
    (citar-denote-keyword "bib")
    (citar-denote-use-bib-keywords nil)
    (citar-denote-title-format "title")
    (citar-denote-title-format-authors 1)
    (citar-denote-title-format-andstr "and")
    :init
    (citar-denote-mode)
    ;; Bind all available commands
    :bind (("C-c w c" . citar-create-note)
           ("C-c w n" . citar-denote-open-note)
           ("C-c w d" . citar-denote-dwim)
           ("C-c w e" . citar-denote-open-reference-entry)
           ("C-c w a" . citar-denote-add-citekey)
           ("C-c w k" . citar-denote-remove-citekey)
           ("C-c w r" . citar-denote-find-reference)
           ("C-c w l" . citar-denote-link-reference)
           ("C-c w f" . citar-denote-find-citation)
           ("C-c w x" . citar-denote-nocite)
           ("C-c w y" . citar-denote-cite-nocite)))

  (provide 'my-citar-setup)
#+end_src

* Office
** Mail
Setup with isync, mu4e, mu4e-consult ...
Some blogs about setting up mu4e with protonmail
https://shom.dev/posts/20220108_setting-up-protonmail-in-emacs/
The best one -> https://gist.github.com/A6GibKm/238b754a4a90051f60906b9efa3e8000

Remember to run:
mu init --maildir=mail/ --my-address='mail@kristianbagge.com' --my-address='register@kristianbagge.com' --my-address='kontor@kristianbagge.com' --my-address='work@kristianbagge.com'
Then afterwards:
mu index
*** Mbsync
Remember to actively export the cert from within the bridge application
Isync = mbsync conf
#+begin_src bash :tangle ~/.local/share/chezmoi/dot_mbsyncrc.tmpl
  IMAPAccount proton
  Host 127.0.0.1
  Port 1143
  User kristianbagge@protonmail.com
  Pass "{{ pass "chezmoi/protonmail/bridge" }}"
  TLSType STARTTLS
  CertificateFile ~/.config/protonmail/bridge-v3/cert.pem


  IMAPStore proton-remote
  Account proton

  MaildirStore proton-local
  Subfolders Verbatim
  Path ~/mail/proton/
  Inbox ~/mail/proton/inbox

  Channel proton
  Far :proton-remote:
  Near :proton-local:
  Patterns *
  Create Both
  SyncState *
  Expunge both

#+end_src
*** Mu4e
#+begin_src emacs-lisp :tangle my-modules/my-mu4e.el
  (use-package mu4e
    :load-path  "/usr/local/share/emacs/site-lisp/mu/mu4e/"
    :config

    (setq mu4e-change-filenames-when-moving t ; avoid sync conflicts
        mu4e-update-interval (* 10 60) ; check mail 10 minutes
        mu4e-compose-format-flowed t ; re-flow mail so it's not hard wrapped
        mu4e-get-mail-command "mbsync -a"
        mu4e-maildir "~/mail/")

    (setq mu4e-drafts-folder "/proton/Drafts"
        mu4e-sent-folder   "/proton/Sent"
        mu4e-refile-folder "/proton/Archive"
        mu4e-trash-folder  "/proton/Trash")

    (setq mu4e-maildir-shortcuts
        '(("/proton/inbox"     . ?i)
          ("/proton/Sent"      . ?s)
          ("/proton/Trash"     . ?t)
          ("/proton/Drafts"    . ?d)
          ("/proton/Archive"  . ?a)))

    (setq message-send-mail-function 'smtpmail-send-it
        auth-sources '("~/.authinfo") ;need to use gpg version but only local smtp stored for now
        smtpmail-smtp-server "127.0.0.1"
        smtpmail-smtp-service 1025
        smtpmail-stream-type  'starttls)

    (add-to-list 'gnutls-trustfiles (expand-file-name "~/.config/protonmail/bridge/cert.pem")))

  (provide 'my-mu4e)
#+end_src
