dot_config/emacs/config.org
** Python
#+begin_src emacs-lisp :tangle my-modules/my-python.el
;;;; Python
;; Some nice resources:
;; - [[https://www.adventuresinwhy.com/post/eglot/][Eglot + treesitter in emacs (python)]]
;; - [[https://gist.github.com/habamax/290cda0e0cdc6118eb9a06121b9bc0d7][Same but other source]]
;; - [[https://www.masteringemacs.org/article/how-to-get-started-tree-sitter][Mastering emacs on treesitter]]

(setq major-mode-remap-alist
      '((python-mode . python-ts-mode)))

;; Remember to install pyright
 (use-package lsp-pyright ; Server for eglot.
   :hook (python-ts-mode . (lambda ()
                          (require 'lsp-pyright))))

;;(add-hook 'python-mode-hook 'eglot-ensure)
;;  (add-to-list 'eglot-server-programs
;;               '(python-ts-mode . ("ruff" "server")))
;;  (add-hook 'after-save-hook 'eglot-format))

;; https://docs.astral.sh/ruff/editors/setup/#emacs
(use-package flymake-ruff
  :ensure t
  :hook (python-ts-mode . flymake-ruff-load))

(use-package ruff-format
  :ensure t
  :hook (python-ts-mode . ruff-format-on-save-mode))


;; See comments here on reddit:
;; https://www.reddit.com/r/emacs/comments/17g1jw3/what_is_yours_configuration_for_python/
;; (use-package conda
;;   :defer t
;;   :init
;;   (setq conda-anaconda-home "~/.mambaforge/")
;; ;; ----- select interpreter

(setq python-shell-interpreter "ipython"
      python-shell-interpreter-arg " -i --simple-prompt --InteractiveShell.display_page=True"
      python-shell-completion-native-enable nil)

;; )

;; ----- emacs-jupyter
;; Disabled since it did not work right
;;  (use-package jupyter
;; ;;   :init
;; ;;   (setq jupyter-use-zmq nil)
;;    ;; :commands
;;    ;; (jupyter-run-server-repl
;;    ;;  jupyter-run-repl
;;    ;;  jupyter-server-list-kernels)
;;    :custom
;;    (jupyter-executable "/.pixi run jupyter kernel")
;;    )
;;  ;;(org-babel-jupyter-override-src-block "python") ;; so python becomes jupyter-python in org-babel

(provide 'my-python)
#+end_src
** Chezmoi
#+begin_src emacs-lisp :tangle my-modules/my-chezmoi.el
;;;; Chezmoi dotfile management
(use-package chezmoi
  )
(provide 'my-chezmoi)
#+end_src
** Latex
#+begin_src emacs-lisp :tangle my-modules/my-latex.el
  ;;;; Latex
  ;; Some options to highlight faces for latex export:
  (use-package engrave-faces
    :init
    (setq org-latex-src-block-backend 'engraved)
    (setq org-latex-engraved-theme 'doom-one-light)
    (setq org-format-latex-options (plist-put org-format-latex-options :scale 1.6)))

  (provide 'my-latex)
#+end_src
** Git
#+begin_src emacs-lisp :tangle my-modules/my-git.el
  ;;;; Magit
  ;; Maybe check out forge at some point to interact with github.
  ;; and git-timemachine: https://codeberg.org/pidu/git-timemachine
  (use-package magit

    :init
    (setq vc-follow-symlinks t) ;; Since I track my init file with git, I don't need a warning every time I open emacs.
    :defer t)

  (provide 'my-git)

#+end_src
** LLM
Remember the .tmpl ending is due to chezmoi injecting sensitive information.
#+begin_src emacs-lisp :tangle my-modules/my-llm.el.tmpl
  ;;;; LLM
  ;; Resources:
  ;; - [[https://emacsconf.org/2023/talks/llm/][Emacs talk on LLM]]
  ;; - [[https://www.reddit.com/r/emacs/comments/18s45of/every_llm_in_emacs_with_gptel/][GPTel video]]
  ;; - [[https://github.com/jart/emacs-copilot][Emacs co-pilot]]
  ;; - [[https://brianlovin.com/hn/38822164][Another input on co-pilot]]
  ;; - [[https://github.com/ahyatt/llm][LLM package]]
  (use-package gptel
    :config
    (gptel-make-kagi "Kagi"                    ;any name
      :key "{{ pass "chezmoi/kagi/api" }}")
    (gptel-make-ollama "Ollama"             ;Any name of your choosing
      :host "localhost:11434"               ;Where it's running
      :stream t                             ;Stream responses
      :models '("mistral:latest"))
    )

  (provide 'my-llm)
#+end_src
* Archive
#+begin_src emacs-lisp
  ;;; Not used at the moment
  ;;;; R language
  ;; Install lintr [[https://github.com/r-lib/lintr][here]]. And the languageserver for R - [[https://github.com/REditorSupport/languageserver][here]].
  ;; Also install some dependencies for the languageserver: (check instructions on the languageserver page in case it changes.
  ;; dnf install --assumeyes --setopt=install_weak_deps=False @development-tools libcurl-devel libxml2-devel openssl-devel R
  ;; (use-package ess
  ;;     :defer t)
  ;;   (autoload #'R "ess")

  ;; Setup Latex at som point - maybe markdown aswell
  ;;; Inspiration from here: https://jakebox.github.io/youtube/org_latex_video.html
  ;; (with-eval-after-load 'ox-latex
  ;; (add-to-list 'org-latex-classes
  ;;              '("org-plain-latex"
  ;;                "\\documentclass{article}
  ;;            [NO-DEFAULT-PACKAGES]
  ;;            [PACKAGES]
  ;;            [EXTRA]"
  ;;                ("\\section{%s}" . "\\section*{%s}")
  ;;                ("\\subsection{%s}" . "\\subsection*{%s}")
  ;;                ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
  ;;                ("\\paragraph{%s}" . "\\paragraph*{%s}")
  ;;                ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))


  ;;; Future inspiration:
  ;;;; - https://github.com/armindarvish/consult-omni

#+end_src
